/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   check_file_content.c                               :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: uheirloo <uheirloo@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/09/26 15:18:15 by djoye             #+#    #+#             */
/*   Updated: 2019/10/08 19:45:36 by djoye            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "fillit.h"

// !!! Дописать функцию проверки фигуры перед возвратом 1

// Проверяет валидность содержания файла пофигурно
// В файле должно быть до 26 матриц 4х4, в каждой 4-5 '\n', 4 '#', а остальное пространство занято 12 '.'
// Записывает правильную фигуру в массив в виде строки
// Возвращает 1 если условия выполнены
int		check_file_content(char *str, int len)
{
	int		i;
	int		c_line;
	int		c_hex;
	int     c_dot;
	int		c_ch;

	i = 0;
	c_line = 0;
	c_hex = 0;
	c_dot = 0;
	c_ch = 0;

	// Проверяет символ в прочитанном буфере на валидность
	// нахождения '\n' в конце строки и между буферами, подсчёт '#' и '.'
	while (i < len)
	{
		if (str[i] == '\n' && ((i + 1) % 5 == 0 || i % 20 == 0))
			c_line++;
		else if (str[i] == '#' && ((i + 1) % 5 != 0 || i % 20 != 0))
			c_hex++;
		else if (str[i] == '.' && ((i + 1) % 5 != 0 || i % 20 != 0))
			c_dot++;
		else
			break ;
		// Проверка фигуры на валидность
		if (str[i] == '#')
			c_ch += (str[i - 1] == '#' ? 1 : 0) + (str[i + 1] == '#' ? 1 : 0) +
				(str[i + 5] == '#' ? 1 : 0) + (str[i - 5] == '#' ? 1 : 0);
		if (c_line >= 3 && c_hex == 4 && c_dot == 12 && (c_ch == 6 || c_ch == 8))
			return (1);
		i++;
	}
	return (0);
}
