/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   check_file_content.c                               :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: uheirloo <uheirloo@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/09/26 15:18:15 by djoye             #+#    #+#             */
/*   Updated: 2019/10/09 13:10:22 by djoye            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "fillit.h"

/* !!! Дописать функцию проверки фигуры перед возвратом 1	
   Проверяет валидность содержания файла пофигурно
	В файле до 26 матриц 4х4, в каждой 4-5 '\n', 4 '#', остальное 12 '.'
	Записывает правильную фигуру в массив в виде строки
	Возвращает 1 если условия выполнены */
int		check_file_content(char *str, int len)
{
	int		i;
	int		c_line;
	int		c_hex;
	int		c_dot;
	int		sum;

	i = 0;
	c_line = 0;
	c_hex = 0;
	c_dot = 0;
	sum = 0; /* Проверяет нахождения '\n' в конце строки, подсчёт '#' и '.' */
	while (i < len)
	{
		if (str[i] == '\n' && ((i + 1) % 5 == 0 || i % 20 == 0))
			c_line++;
		else if (str[i] == '#' && ((i + 1) % 5 != 0 || i % 20 != 0))
			c_hex++;
		else if (str[i] == '.' && ((i + 1) % 5 != 0 || i % 20 != 0))
			c_dot++;
		else
			break ; /* Проверка фигуры на валидность */
		if (str[i] == '#')
			sum += (str[i - 1] == '#' ? 1 : 0) + (str[i + 1] == '#' ? 1 : 0) +
				(str[i + 5] == '#' ? 1 : 0) + (str[i - 5] == '#' ? 1 : 0);
		if (c_line >= 3 && c_hex == 4 && c_dot == 12 && (sum == 6 || sum == 8))
			return (1);
		i++;
	}
	return (0);
}
