/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   check_file_content.c                               :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: uheirloo <uheirloo@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/09/26 15:18:15 by djoye             #+#    #+#             */
/*   Updated: 2019/10/02 16:49:02 by uheirloo         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "fillit.h"

// Проверяет валидность содержания файла без проверки валидности фигур
// В файле должно быть до 26 матриц 4х4, в каждой 5 '\n', 4 '#', а остальное пространство занято 12 '.'
// Возвращает 1 если условия выполнены
int		check_file_content(char *str, int len)
{
	int		i;
	int		c_line;
	int		c_hex;
	int     c_dot;

	i = 0;
	c_line = 0;
	c_hex = 0;
	c_dot = 0;

	// Проверяет символ в прочитанном буфере на валидность
	// нахождения '\n' в конце строки и между буферами, подсчёт '#' и '.'
	// !!! Добавить выход из цикла при нахождении любого другого символа без прогона буфера до конца!!!
	while (i < len)
	{
		if (str[i] == '\n' && ((i + 1) % 5 == 0 || i % 20 == 0))
			c_line++;
		if (str[i] == '#' && ((i + 1) % 5 != 0 || i % 20 != 0))
			c_hex++;
		if (str[i] == '.' && ((i + 1) % 5 != 0 || i % 20 != 0))
			c_dot++;
		if (c_line >= 4 && c_hex == 4 && c_dot == 12)
			return (1);
		i++;
	}
	return (0);
}

int		main(int argc, char **argv)
{
	int		fd;
	char	buf[BUFF_SIZE + 1];
	int		len;

	fd = open(argv[argc - 1], O_RDONLY);
	while((len = read(fd, buf, BUFF_SIZE)) > 0)
		printf("%d\n", check_file_content(buf, len));
	return (0);
}
